rails6-bookers2-debug-ruby3-main/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book), notice: "You have created book successfully."
    else
      @user = current_user
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "a"], ["body", "a"], ["user_id", 2], ["created_at", "2023-06-06 06:37:21.604024"], ["updated_at", "2023-06-06 06:37:21.604024"]]
SELECT "books".* FROM "books"

  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "d"], ["updated_at", "2023-06-06 07:22:02.672331"], ["id", 8]]

  def is_matching_login_user
    book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]