rails6-bookers2-debug-ruby3-main/app/controllers/users_controller.rb

  def edit
    is_matching_login_user
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
    is_matching_login_user
    if @user.update(user_params)
---
UPDATE "users" SET "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", ""], ["updated_at", "2023-06-06 08:03:10.255729"], ["id", 4]]

  def ensure_correct_user
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

    def is_matching_login_user
    user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]